[
  {
    "name": "Drawing Compare",
    "year": "2025",
    "blurb": "Redesigned drawing comparison for AutoCAD Web: from 0.2% usage on desktop to highest driver of adoption on web."
  },
  {
    "name": "Search",
    "year": "2025",
    "blurb": "Multiple search features from 2022-2025, covering in-drawing text, tabbed dialogs (i.e. settings), and file manager (where I also handled front-end implementation)."
  },
  {
    "name": "Hackathon t-shirt",
    "year": "2025",
    "blurb": "Is it possible to design hackathon swag teammates actually want to wear? Reversing a decade-plus of \"no\" on our team through informal research, getting into the details of garment design, and cats."
  },
  {
    "name": "Year of the Snake poster",
    "year": "2025",
    "blurb": "Digital illustration → 2-color print to ring in last lunar new year, trying to overcome the snake's culturally-ubiquitous bad reputation."
  },
  {
    "name": "Capturing field data with LiDAR",
    "year": "2024",
    "blurb": "New use case for AutoCAD mobile: integrating on-site mobile data capture into project drawings through photos, videos, and LiDAR / RoomPlan API."
  },
  {
    "name": "Cloud drawing continuity",
    "year": "2023",
    "blurb": "Building trust in the cloud with a traditional, skeptical user base with highly-transparent, provider-agnostic file access across devices."
  },
  {
    "name": "Custom LISP plugin support",
    "year": "2022",
    "blurb": "Designing-by-code to support 40 years of customer-made plugins on Web for the first time."
  },
  {
    "name": "Notifications refactor",
    "year": "2022",
    "blurb": "Systematizing a decade-plus of ever-accumulating, customer-irritating messaging with a logical, extensible framework for notification design."
  },
  {
    "name": "Web apps design technology",
    "year": "2019",
    "blurb": "Design systems (Storybook, Figma API), human processes (design-engineering handoff, design systems compliance), engineering mentorship on the web apps team at Proteus Digital Health."
  },
  {
    "name": "Childrens' health scorecard",
    "year": "2018",
    "blurb": "Solo 0→1 design and dev revolutionizing how Children Now advocates for kids' wellness with a dynamic, layered, and easy-to-explore data visualization for web and mobile, using SVG, React, styled-components, MobX, and Storybook."
  },
  {
    "name": "LinkedIn Sales Navigator integration",
    "year": "2017",
    "blurb": "Solo 0→1 design and dev for Sendbloom's integration of marquee new LinkedIn feature: started to shipped in 1 week, to coincide with LinkedIn's official product announcement."
  },
  {
    "name": "Goals & Tasks tracking",
    "year": "2017",
    "blurb": "Solo 0→1 design and dev of widget and panel designed for sales reps to track and rank their progress towards team-set goals on Sendbloom."
  },
  {
    "name": "Optimizing email campaigns",
    "year": "2017",
    "blurb": "Solo 0→1 design and dev enabling sales reps to add new recipients into an ongoing email campaign, by user request - using animation to preserve context and delight across multiple steps."
  },
  {
    "name": "0→1 UI Component Library",
    "year": "2017",
    "blurb": "As designer #2 on a <10-employee startup, learned, then single-handedly built React Storybook to systematize our UI engineering - evangelizing component reuse, extending components to meet engineers' needs, building my own designs in Storybook, and writing API docs."
  },
  {
    "name": "Astronomical app onboarding",
    "year": "2016",
    "blurb": "Designed+animated onboarding animation for swiping in Origami Logic's mobile app."
  },
  {
    "name": "Social Energy Sensing Monument",
    "year": "2013-2015",
    "blurb": "Interactive installation that combines robotics, IoT, and a mobile web app into a public monument for engaging and enthralling a community with its own issues and the underlying data."
  },
  {
    "name": "Mars spaceflight mission design",
    "year": "2014",
    "blurb": "Produced initial pitch animation, then final, one-shot (no \"camera cuts\") 15-minute presentation showcasing Eclipse Rocketry Club at Davis' proposal for a manned flyby of Mars. Took 4th place of 38 among international qualifiers for Inspiration Mars conference in Houston."
  },
  {
    "name": "Assorted pitch videos",
    "year": "2012, 2015",
    "blurb": "Animations promoting Stuffrage (startup incubating at Davis in 2012) and Wake (smart alarm clock which was successfully funded on Kickstarter), and myself (old portfolio reel from 2014 of pre-college and student design, 2007-2014)."
  }
]